// 模拟数据
 export var locationData = {
     // 基础信息
     basic: {
         // 所在城市的上级市
         parent_city: '佛山',
         // 所在城市
         location: '禅城',
         // 所在经度
         lon: "113.1124115",
         // 所在纬度
         lat: "23.01964378",
         // 城市id
         cid: 'CN101280805'
     },
     // 实时天气
     now: {
         // 温度
         tmp: '28',
         // 实况天气状况代码
         cond_code: '104',
         // 实况天气状况描述
         cond_txt: '阴'
         // 
     },
     // 未来3天天气
     daily_forecast: [{
             // 预报日期
             date: '2018-09-25',
             // 白天天气状态码
             cond_code_d: '302',
             // 晚间天气状态码
             cond_code_n: '101',
             // 白天天气状态描述
             cond_txt_d: '雷阵雨',
             // 晚间天气状态描述
             cond_txt_n: '多云',
             // 最高温度
             tmp_max: '31',
             // 最低温度
             tmp_min: '25',
         },
         {
             // 预报日期
             date: '2018-09-26',
             // 白天天气状态码
             cond_code_d: '101',
             // 晚间天气状态码
             cond_code_n: '101',
             // 白天天气状态描述
             cond_txt_d: '多云',
             // 晚间天气状态描述
             cond_txt_n: '多云',
             // 最高温度
             tmp_max: '33',
             // 最低温度
             tmp_min: '27',
         },
         {
             // 预报日期
             date: '2018-09-27',
             // 白天天气状态码
             cond_code_d: '101',
             // 晚间天气状态码
             cond_code_n: '100',
             // 白天天气状态描述
             cond_txt_d: '多云',
             // 晚间天气状态描述
             cond_txt_n: '晴',
             // 最高温度
             tmp_max: '32',
             // 最低温度
             tmp_min: '26',
         },
     ],
     // 生活指数
     lifestyle: [
         // 舒适度指数
         {
             type: 'comf',
             brf: "较不舒适",
             txt: "白天虽然有雨，但仍无法削弱较高气温带来的暑意，同时降雨造成湿度加大会您感到有些闷热，不很舒适。",
             name: '舒适度指数',
             icon: '\ue70b'
         },
         // 穿衣指数
         {
             type: 'drsg',
             brf: "热",
             txt: "天气热，建议着短裙、短裤、短薄外套、T恤等夏季服装。",
             name: '穿衣指数',
             icon: '\ue666'
         },
         // 感冒指数
         {
             type: 'flu',
             brf: "少发",
             txt: "各项气象条件适宜，发生感冒机率较低。但请避免长期处于空调房间中，以防感冒。",
             name: '感冒指数',
             icon: '\ue648'
         },
         // 运动指数
         {
             type: 'sport',
             brf: "较不宜",
             txt: "有降水，推荐您在室内进行低强度运动；若坚持户外运动，须注意选择避雨防滑地点，并携带雨具。",
             name: '运动指数',
             icon: '\ue649'
         },
         // 旅游指数
         {
             type: 'trav',
             brf: "一般",
             txt: "有降水，稍热，微风，旅游指数一般，外出请尽量避开降雨时间，若外出，请注意防雷并携带雨具。",
             name: '旅游指数',
             icon: '\ue60c'
         },
         // 紫外线指数
         {
             type: 'uv',
             brf: "中等",
             txt: "属中等强度紫外线辐射天气，外出时建议涂擦SPF高于15、PA+的防晒护肤品，戴帽子、太阳镜。",
             name: '紫外线指数',
             icon: '\ue74a'
         },
     ],
     // 刷新时间
     update: {
         // 当地时间
         loc: "2018-09-25 13:46",
         // UTC时间
         utc: "2018-09-25 05:46"
     }
 }